src/Catalogs/ПробныеВещи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПробныеВещи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ПроверкаПлатформыСервер/Ext/Module.bsl
// Spike T-001: серверная часть проверки мобильной платформы.
// Код только для ветки spike, в main не попадает.

#Область ПрограммныйИнтерфейс

// Сохраняет фото в новую пробную вещь.
//
// Параметры:
//  ДанныеФото - ДвоичныеДанные
//  Источник - Строка - откуда получено фото, для наименования.
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция СохранитьФото(ДанныеФото, Источник) Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Вещь = Справочники.ПробныеВещи.СоздатьЭлемент();
	Вещь.Наименование = СтрШаблон("Фото (%1) %2", Источник, Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM HH:mm:ss'"));
	Вещь.Фото = Новый ХранилищеЗначения(ДанныеФото);
	Вещь.Записать();

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	Возврат СтрШаблон("Фото сохранено: %1 КБ, запись %2 мс", Окр(ДанныеФото.Размер() / 1024), Длительность);

КонецФункции

// Сохраняет фото, помещённое во временное хранилище.
//
// Параметры:
//  Адрес - Строка - адрес во временном хранилище.
//  ИмяФайла - Строка
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция СохранитьФотоИзХранилища(Адрес, ИмяФайла) Экспорт

	ДанныеФото = ПолучитьИзВременногоХранилища(Адрес);
	УдалитьИзВременногоХранилища(Адрес);
	Возврат СохранитьФото(ДанныеФото, ИмяФайла);

КонецФункции

// Создаёт пробные вещи. Каждой пятой прикладывает копию последнего сохранённого фото.
//
// Параметры:
//  Количество - Число
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция СгенерироватьДанные(Количество) Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Образец = ПоследнееФото();
	Слова = СтрРазделить("Фильтр воды,Котёл,Стиральная машина,Кофемашина,Дрель,Шуруповёрт,Холодильник,"
		+ "Кондиционер,Насос,Пылесос,Телевизор,Роутер,Счётчик воды,Датчик дыма,Газонокосилка", ",");
	СФото = 0;

	НачатьТранзакцию();
	Попытка
		Для Номер = 1 По Количество Цикл
			Вещь = Справочники.ПробныеВещи.СоздатьЭлемент();
			Вещь.Наименование = СтрШаблон("%1 №%2", Слова[Номер % Слова.Количество()], Номер);
			Вещь.Заметка = "Сгенерировано для замера производительности";
			Вещь.ДатаНапоминания = ТекущаяДатаСеанса() + Номер * 86400;
			Если Образец <> Неопределено И Номер % 5 = 0 Тогда
				Вещь.Фото = Новый ХранилищеЗначения(Образец);
				СФото = СФото + 1;
			КонецЕсли;
			Вещь.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	Возврат СтрШаблон("Создано записей: %1, с фото: %2, за %3 мс", Количество, СФото, Длительность);

КонецФункции

// Ищет вещи по подстроке в наименовании.
//
// Параметры:
//  СтрокаПоиска - Строка
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция ЗамеритьПоиск(СтрокаПоиска) Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПробныеВещи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПробныеВещи КАК ПробныеВещи
	|ГДЕ
	|	ПробныеВещи.Наименование ПОДОБНО &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", "%" + СтрокаПоиска + "%");
	Найдено = Запрос.Выполнить().Выгрузить().Количество();

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	Возврат СтрШаблон("Поиск ""%1"": найдено %2 за %3 мс", СтрокаПоиска, Найдено, Длительность);

КонецФункции

// Читает список вещей без фото, как это делал бы экран списка.
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция ЗамеритьСписок() Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПробныеВещи.Ссылка КАК Ссылка,
	|	ПробныеВещи.Наименование КАК Наименование,
	|	ПробныеВещи.ДатаНапоминания КАК ДатаНапоминания
	|ИЗ
	|	Справочник.ПробныеВещи КАК ПробныеВещи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНапоминания";
	Прочитано = Запрос.Выполнить().Выгрузить().Количество();

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	Возврат СтрШаблон("Список: прочитано %1 записей за %2 мс", Прочитано, Длительность);

КонецФункции

// Удаляет все пробные вещи.
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция УдалитьПробныеДанные() Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Удалено = 0;

	НачатьТранзакцию();
	Попытка
		Выборка = Справочники.ПробныеВещи.Выбрать();
		Пока Выборка.Следующий() Цикл
			Выборка.ПолучитьОбъект().Удалить();
			Удалено = Удалено + 1;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	Возврат СтрШаблон("Удалено записей: %1 за %2 мс", Удалено, Длительность);

КонецФункции

// Формирует JSON со всеми вещами (без фото) и манифестом, как будущий export.
//
// Возвращаемое значение:
//  Структура:
//   * Данные - ДвоичныеДанные - текст JSON в UTF-8.
//   * Журнал - Строка
//
Функция СформироватьВыгрузку() Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПробныеВещи.Ссылка КАК Ссылка,
	|	ПробныеВещи.Наименование КАК Наименование,
	|	ПробныеВещи.Заметка КАК Заметка,
	|	ПробныеВещи.ДатаНапоминания КАК ДатаНапоминания
	|ИЗ
	|	Справочник.ПробныеВещи КАК ПробныеВещи";
	Выборка = Запрос.Выполнить().Выбрать();

	Вещи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Вещь = Новый Структура;
		Вещь.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Вещь.Вставить("name", Выборка.Наименование);
		Вещь.Вставить("note", Выборка.Заметка);
		Вещь.Вставить("reminderAt", Выборка.ДатаНапоминания);
		Вещи.Добавить(Вещь);
	КонецЦикла;

	Выгрузка = Новый Структура;
	Выгрузка.Вставить("formatVersion", 1);
	Выгрузка.Вставить("dataVersion", Константы.ВерсияДанных.Получить());
	Выгрузка.Вставить("createdAt", ТекущаяУниверсальнаяДата());
	Выгрузка.Вставить("assets", Вещи);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(Запись, Выгрузка);
	Текст = Запись.Закрыть();

	Данные = ПолучитьДвоичныеДанныеИзСтроки(Текст, КодировкаТекста.UTF8, Ложь);
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;

	Результат = Новый Структура;
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("Журнал", СтрШаблон("JSON: %1 вещей, %2 КБ, за %3 мс",
		Вещи.Количество(), Окр(Данные.Размер() / 1024), Длительность));
	Возврат Результат;

КонецФункции

// Читает выбранный пользователем файл как JSON-выгрузку.
//
// Параметры:
//  Адрес - Строка - адрес во временном хранилище.
//  ИмяФайла - Строка
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция ПрочитатьФайл(Адрес, ИмяФайла) Экспорт

	Данные = ПолучитьИзВременногоХранилища(Адрес);
	УдалитьИзВременногоХранилища(Адрес);
	Итог = СтрШаблон("Файл ""%1"": %2 КБ", ИмяФайла, Окр(Данные.Размер() / 1024));

	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(Данные, КодировкаТекста.UTF8));
		Выгрузка = ПрочитатьJSON(Чтение, Ложь);
		Чтение.Закрыть();
		Итог = Итог + СтрШаблон(", formatVersion = %1, вещей: %2",
			Выгрузка.formatVersion, Выгрузка.assets.Количество());
	Исключение
		Итог = Итог + ", это не JSON-выгрузка: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Итог;

КонецФункции

// Увеличивает версию данных на единицу.
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция УвеличитьВерсиюДанных() Экспорт

	Текущая = ВерсияДанных();
	Константы.ВерсияДанных.Установить(Формат(Текущая + 1, "ЧГ="));
	Возврат СтрШаблон("Версия данных: %1 -> %2", Текущая, Текущая + 1);

КонецФункции

// Возвращает сводку о состоянии базы.
//
// Возвращаемое значение:
//  Строка - строка для журнала.
//
Функция СостояниеБазы() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПробныеВещи.Ссылка) КАК Всего
	|ИЗ
	|	Справочник.ПробныеВещи КАК ПробныеВещи";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат СтрШаблон("База: вещей %1, версия данных %2, версия конфигурации %3",
		Выборка.Всего, ВерсияДанных(), Метаданные.Версия);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВерсияДанных()

	Значение = СокрЛП(Константы.ВерсияДанных.Получить());
	Если ПустаяСтрока(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Число(Значение);

КонецФункции

Функция ПоследнееФото()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПробныеВещи.Фото КАК Фото
	|ИЗ
	|	Справочник.ПробныеВещи КАК ПробныеВещи
	|ГДЕ
	|	ПробныеВещи.Наименование ПОДОБНО ""Фото%""";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Выборка.Фото.Получить();
		Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
			Возврат Данные;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

#КонецОбласти
